package com.example.dara

import kotlin.collections.mapOf

object TarotDeck {

    val cards = listOf(

        TarotCard(
            R.drawable.fool,
            "The Fool",
            mapOf(
                "work" to "ไพ่ใบนี้เป็นไพ่ที่บ่งบอกถึงอิสระ และความเสี่ยงจึงออกมาได้ทั้งในแนวทางที่ดีและเสีย เป็นไปได้ตั้งแต่การโดนออกจากงานมาเพื่อทำในสิ่งที่รักการทำงาน Freelance",
                "money" to "มีการใช้จ่ายที่มากเพราะมักจะทำตามใจตัวเอง มีการซื้อของที่อาจจะเกินตัวไปบ้าง แต่ก็ยังอยู่ในจุดที่ยังพอรับมือได้ หากพูดถึงเรื่องการลงทุนก็ต้องบอกว่าเป็นการลงทุนที่มีความเสี่ยงระดับนึงง",
                "love" to "มีอิสระที่จะคิดและรักจึงเป็นคนที่มองโลกในพร้อมที่จะเผชิญปัญหาที่อาจจะหนักหน่วง เพื่อแง่ดี สิ่งที่เรารักและอาจหมายถึงคนที่ยังรักอิสระอยู่ก็ได้",
                "health" to "ตัวไพ่บ่งบอกถึงสุขภาพที่อาจจะมีปัญหาจากพฤติกรรมที่เสี่ยงและทำตามใจได้ Fool เป็นไพ่แห่งดาวยูเรนัส ซึ่งหมายถึงเหตุการณ์ที่เปลี่ยนแปลงไม่คาดคิด ดังนั้นจึงควร ระวังเรื่องอุบัติเหตุ และเรื่องเกี่ยวกับไฟฟ้า รังสีให้ดี"
            ),
            dayAffinity = emptyList(),
            zodiacAffinity = listOf("ราศีกุมภ์")
        ),
        TarotCard(
            R.drawable.magician,
            "The Magician",
            mapOf(
                "work" to "เป็นช่วงเวลาที่มีไอเดียที่จะเริ่มต้นทำสิ่งใหม่ โครงการใหม่ๆ ซึ่งผลลัพธ์จะออกมาค่อนข้างดี การสื่อสารดูจะโดดเด่นในช่วงนี้เป็นช่วงเวลาที่ถ้าได้สื่อสารเจรจาต่างๆ จะสำเร็จไปด้วยดี ",
                "money" to "มีความสามารถในการจัดการเงินและทรัพยากรอย่างมีประสิทธิภาพ สามารถหาโอกาสในการเพิ่มรายได้ หรือการลงทุนที่ดี เป็นช่วงเวลาที่ดีเริ่มต้นในการวางแผนการเงินและลงทุน",
                "love" to "ความรัก ความสัมพันธ์ที่จักรวาลเปิดทางให้ เพราะทุกอย่างดูจะดีไปหมดในทุกๆด้าน ทั้งอารมณ์และความคิด หากมีความไม่เข้าใจกันก็จะทำการปรับความเข้าใจกันได้อย่างดี ส่งเสริมความมั่นคง มั่งคั่ง ร่ำรวย อุดมสมบูรณ์",
                "health" to "การพบแพทย์หรือการหาแนวทางในการดูแลตัวเองเป็นไปได้ด้วยดี เรียกได้ว่าเป็นจุดเริ่มต้นที่ดีในการฟื้นฟู และเยียวยาตัวเอง ตัวไพ่อาจตีความว่ามีการเตือนในเรื่องของระบบการหายใจได้ด้วยครับ"
            ),
            dayAffinity = listOf("วันพุธ"),
            zodiacAffinity = listOf("ราศีเมถุน", "ราศีกันย์")
        ),
        TarotCard(
            R.drawable.high_priestes,
            "The High Priestess",
            mapOf(
                "work" to "บ่งบอกถึงการใช้สัญชาตญาณและความรู้สึกภายในในการตัดสินใจในเรื่องการงาน การทำงานด้วยความรู้ ลึกซึ้งและการเข้าใจสถานการณ์ต่าง ๆ ที่ซ่อนเร้น เป็นช่วงเวลาที่เหมาะสมในการรวบรวมข้อมูลและคิด วิเคราะห์อย่างลึกซึ้งก่อนลงมือทำ",
                "money" to "ไพ่ใบนี้แสดงถึงคุณมีเซนส์ในการจัดการการเงินดี การรับรู้ถึงโอกาสที่ซ่อนอยู่เป็นช่วงที่หาก มีการตัดสินใจจะถูกต้องและส่งผลที่ดีต่อการเงินได้ครับ ช่วงนี้อาจจะเป็นช่วงที่คุณไม่แสดงออกเรื่องเงินเท่าไหร่ ี",
                "love" to "ความสัมพันธ์ที่ซับซ้อน ไม่ชัดเจน มีความลังเล และรู้สึกลึก ๆ ถึงบาง อย่างที่ทำให้เราไม่สามารถก้าวต่อไปแบบตรง ๆ ได้ ",
                "health" to "เป็นช่วงที่คุณจะได้มีการรับฟังสัญญาณจากร่างกาย จะได้มีการดูแลตัวเองอย่างลึกซึ้ง หากกำลังมีการรักษาก็มีโอกาสที่จะได้รับการเยียวยา ไปดีขึ้น อาจจะได้พบแพทย์หรือพบแนวทางที่ดีขึ้น สำหรับผู้หญิงให้ระวังโรคเกี่ยวกับ เช่น หน้าอก มดลูก รังไข่ "
            ),
            dayAffinity = listOf("วันจันทร์"),
            zodiacAffinity = listOf("ราศีกรกฎ")
        ),
        TarotCard(
            R.drawable.empress,
            "The Empress",
            mapOf(
                "work" to "ความเจริญรุ่งเรืองในด้านการงาน เป็นช่วงเวลาที่สร้างสรรค์และมีโอกาสใหม่ๆ เกิดขึ้น การทำงานร่วมกับทีมงานที่มีความร่วมมือและการสนับสนุนซึ่งกันและกันอย่างดี ",
                "money" to "ความอุดมสมบูรณ์และความมั่งคั่งทางการเงิน การมีความคิดสร้างสรรค์ในการ หาเงินและการลงทุนที่ประสบผลสำเร็จ การได้รับผลตอบแทนที่ดีจากการทำงานหรือการลงทุน การมีทรัพยากรที่เพียงพอน",
                "love" to "ไพ่ใบนี้ในด้านความรักค่อนข้างดีทีเดียวเป็นความรักที่อุดมสมบูรณ์ ราบรื่น พร้อมให้กำเนิดสิ่งใหม่ โดยเฉพาะถ้าเป็นไพ่แทนตัวผู้หญิงด้วยแล้ว มันหมายถึงว่าอีกฝ่ายที่เป็นผู้ชายนั้นมอบใจและกายให้ คุณจนหมดโดยที่คุณไม่ได้ควบคุมอะไร",
                "health" to "เป็นช่วงเวลาที่ร่างกายและจิตใจอยู่ในสภาพที่ดี ความสมดุลระหว่างชีวิตประจำวันและการดูแลสุขภาพจะนำมาซึ่งความสุขและความแข็งแรง ไพ่ใบนี้ยังสื่อถึงการฟื้นฟูและการรักษาที่ได้ผลดีไพ่ยังพูดถึงการมีลูก การตั้งครรภ์ "
            ),
            dayAffinity = listOf("วันศุกร์"),
            zodiacAffinity = listOf("ราศีพฤษภ", "ราศีตุลย์")

        ),
        TarotCard(
            R.drawable.emperor,
            "The Emperor",
            mapOf(
                "work" to "การมีเสถียรภาพ ความเป็นผู้นำและความสามารถในการจัดการ คุณมีความมั่นใจในการตัดสินใจและสามารถควบคุมสถานการณ์ในที่ทำงานได้ดี ความสามารถในการวางแผนและการบริหารจัดการที่ดีจะช่วยให้คุณสามารถนำพาทีมงานไปสู่ความสำเร็จ",
                "money" to "การจัดการการเงินไปอย่างมีระบบ มีการควบคุมการเงินของตนเองและมีการวางแผนการเงินที่ดี คำแนะนำคือให้รักษาระเบียบวินัยในการใช้จ่ายและการออมเงินใช้ความสามารถในการจัดการการเงินเพื่อให้บรรลุเป้าหมายทางการเงินที่ตั้งไว้ ",
                "love" to "ไพ่ใบนี้เป็นไพ่ที่บ่งบอกถึงความรักที่ดี มั่นคง แต่ความรักความสัมพันธ์ก็อาจจะดูนิ่งซักหน่อยอาจไม่หวาน ไม่โรแมนติก แต่ก็จริงจังและชัดเจน แต่ความสัมพันธ์ส่วนใหญ่ดูเป็นฝ่ายชายเป็นคนควบคุม",
                "health" to "มีการวางแผนและจัดการสุขภาพของตนเองอย่างมีประสิทธิภาพ มีระเบียบและมีวินัยในการดูแลสุขภาพ หากมีการรักษาอยู่จะเป็นไปได้ด้วยดี ให้ระวังเรื่องกล้ามเนื้อเนื่องจากการใช้งานที่หนักเกินไป"
            ),
            dayAffinity = listOf("วันอังคาร"),
            zodiacAffinity = listOf("ราศีเมษ")
        ),
        TarotCard(
            R.drawable.hierophant,
            "The Hierophant",
            mapOf(
                "work" to "การทำงานในสภาพแวดล้อมที่มีโครงสร้างและระเบียบแบบแผน การทำงานร่วมกับผู้อื่นในกรอบที่มีการกำหนดไว้อย่างชัดเจน อาจเป็นการทำงานในหน่วยงานราชการ หรือองค์กรที่มีระบบการจัดการอย่างเข้มงวด ไพ่ใบนี้ยังสื่อถึงการที่จะได้เรียนรู้และพัฒนาตนเอง", //พอไหว
                "money" to "มีการวางแผนการเงินตามแบบแผน หรือการศึกษาหาความรู้ด้านการเงิน มีคนแนะนำหรือมีที่ ปรึกษาเข้ามาช่วยเหลืออาจหมายถึงการจัดการเงินอย่างระมัดระวังและปฏิบัติตามกฎเกณฑ์ทางการเงินที่เคร่งครัด",
                "love" to "ไพ่ใบนี้ในด้านความรัก หมายถึงการมีข้อตกลงซึ่งกันและกัน ต่างฝ่ายที่ต่างมีแนวคิดในความสัมพันธ์ที่ต่างกัน จึงมาคุยกันเพื่อตกลงแนวคิดด้านความสัมพันธ์ร่วมกัน เช่น ตกลงว่าจะรักกันแบบเป็นแฟนกัน, ตกลงกันว่าเป็นแค่เพื่อนกันแต่โดยปกติ",
                "health" to "การดูแลสุขภาพตามหลักการและข้อแนะนำที่ได้รับจากผู้เชี่ยวชาญหรือผู้รู้ เช่น แพทย์ ปฏิบัติตามวิธีการรักษาหรือการดูแลสุขภาพที่ได้รับการยอมรับและมีมาตรฐาน ทำให้สุขภาพเลยเป็นไปในแนวทางที่ดีขึ้น ภูมิคุ้นกันก็ดีขึ้น"
            ),
            dayAffinity = listOf("วันศุกร์"),
            zodiacAffinity = listOf("ราศีพฤษภ")
        ),
        TarotCard(
            R.drawable.lovers,
            "The Lovers",
            mapOf(
                "work" to "เป็นช่วงที่จะมีทางเลือกเข้ามาในการงาน การตัดสินใจเกี่ยวกับการงานในช่วงนี้ควรทำด้วยความรอบคอบและการพิจารณาจากทุกด้าน อาจจะเป็นช่วงมีการร่วมมือหรือการทำงานเป็นทีม เน้นการสื่อสารได้บ",
                "money" to "มีโอกาสเข้ามาในการเพิ่มรายได้ หรือทำการเงินให้ดีมากยิ่งขึ้น เป็นช่วงเวลาที่มีตัวเลือกอยู่ที่ว่าจะเลือกทางไหนยังไง ควรพิจารณาและตัดสินใจให้ดี และที่สำคัญคืออาจจะพูดเรื่องการเงินที่ได้จากการติดต่อสื่อสาร ",
                "love" to "ไพ่นี้เน้นเรื่องความรักโดยตรงเป็นไพ่แห่งพรหมลิขิตที่ทำให้เราได้พบเจอคนที่ใช่ เข้ากันได้ดี มีความชอบซึ่งกันและกันไพ่เหมือนจะดีทุกอย่างในด้านความรัก เพียงแต่ว่าอาจมีจุดที่เป็นทางเลือก ยังลังเลตัดสินใจยาก",
                "health" to "สุขภาพของคุณอยู่ในเกณฑ์ดีมีคนที่รักและใส่ใจอยู่ข้างๆ การทำกิจกรรมร่วมกับคนที่คุณรักจะช่วยเพิ่มความสุขและสุขภาพจิตใจที่ดี ตัวไพ่สามารถบ่งบอกโรคได้ อย่างโรคผิวหนัง และส่วนของร่างกายที่เป็นคู่ เช่น หู ตา "
            ),
            dayAffinity = listOf("วันพุธ"),
            zodiacAffinity = listOf("ราศีเมถุน")
        ),
        TarotCard(
            R.drawable.chariot,
            "The Chariot",
            mapOf(
                "work" to "การงานมีความก้าวหน้า เดินหน้าไปได้ด้วยดี พร้อมลุย พร้อมทำงานโดยไม่กังวลกับอุปสรรคและความท้าทาย สามารถควบคุมสถานการณ์ได้ และมีโอกาสที่จะมีการเดินทางจากเรื่องการงาน",
                "money" to "การเงินมีโอกาสที่ดีมากยิ่งขึ้น อะไรที่ติดขัดก็จะเดินหน้าไปได้ด้วยดี แม้มีอุปสรรคก็จะฝ่าฟันไปได้ มีโอกาสที่การเงินจะดีขึ้น การลงทุนลงแรงได้รับผลตอบแทนที่ดี",
                "love" to "ไพ่ใบนี้เป็นได้ทั้งดีและไม่ดี แต่หลักๆคือการใช้ความมุ่งมั่นเดินหน้าในความสัมพันธ์ อาจแปลได้ในหลายๆแบบ เช่น เค้าไม่สนใจคุณ ก็ยังตั้งใจเดินหน้าจีบแต่โดยปกติไพ่ใบนี้ถือว่าค่อนข้างดี",
                "health" to "ตัวไพ่บ่งบอกถึงการต่อสู้ลุยกับอุปสรรคได้ ต่อให้มีการเจ็บ ป่วยก็สามารถลุยเดินหน้ารักษาตัวได้อย่างดี หรืออาจจะเกี่ยวกับโรคที่เกี่ยวกับปัญหาระบบอาหาร ขับถ่าย ปัสสาวะ การบวมน้ำ มดลูก หน้าอก"
            ),
            dayAffinity = listOf("วันจันทร์"),
            zodiacAffinity = listOf("ราศีกรกฎ")
        ),
        TarotCard(
            R.drawable.strength,
            "The Strength",
            mapOf(
                "work" to "ความมั่นใจในตนเองและความสามารถในการจัดการกับสถานการณ์ที่ท้าทาย คุณสามารถควบคุมอารมณ์และความมุ่งมั่นภายในได้อย่างดี ทำให้ทำงานได้อย่างมีประสิทธิภาพ นอกจากนี้ยังสื่อถึงความกล้าหาญในการเผชิญหน้ากับความยากลำบาก",
                "money" to "ความมั่นคงและการควบคุมการเงินได้อย่างดี คุณมีวินัยในการจัดการการเงิน สามารถวางแผนและตัดสินใจเรื่องการเงินอย่างมีสติ ความสามารถในการควบคุมอารมณ์และไม่ใช้ อารมณ์ในการตัดสินใจช่วยให้คุณสามารถรักษาเสถียรภาพทางการเงินได้ ",
                "love" to "ไพ่ใบนี้ในด้านความรัก ก็ถือเป็นความรักที่เข้มแข็ง และไม่แพ้อุปสรรคอะไรง่ายๆ ถ้าหากมีการทะเลาะ เบาะแว้งกันก็สามารถควบคุมอารมณ์และเข้าใจกัน ได้ง่าย สามารถพัฒนาเป็นความสัมพันธ์ระยะยาวที่ดี",
                "health" to "ความแข็งแกร่งและความมั่นคงทางร่างกายและจิตใจ คุณมีพลังและความสามารถในการฟื้นตัวจากปัญหาสุขภาพที่อาจเกิดขึ้นผลดีต่อสุขภาพ ตัวไพ่ยังบอกให้ระวังเรื่องความเหนื่อยล้า อาการบริเวณหัวใจ ซี่โครง กระดูกสันหลัง"
            ),
            dayAffinity = listOf("วันอาทิตย์"),
            zodiacAffinity = listOf("ราศีสิงห์")
        ),
        TarotCard(
            R.drawable.hermit,
            "The Hermit",
            mapOf(
                "work" to "ด้านการงานมองได้หลายแง่ ไม่ว่าจะการทำงานคนเดียว อาจจะเป็นเป็นช่วงกำลังค้นหาตัวเอง หรือค้นหาคำตอบคนเดียว ซึ่งมีโอกาสที่จะได้คำตอบสูง มีการเดินทางไปทำงานที่ต้องแยกตัวออกไปจากทีม จากครอบครัว ",
                "money" to "ไพ่ไม่ได้บอกอะไรในเรื่องการเงินสักเท่าไหร่ แต่ก็ออกแนวเป็นช่วงเก็บตัว ดังนั้นเรื่องการเงินเลยออกไปใน แนวไม่ได้มีการใช้จ่าย ลดการใช้จ่าย อาจจะกำลังมองหาทางออกทางด้านการเงิน เพื่อให้เงินมากขึ้นได้ ซึ่งมีแนวโน้มที่จะเป็นไปในทางที่ดี",
                "love" to "ไพ่ใบนี้ด้านความรัก ส่วนใหญ่จะแปลถึงความโสด ก็ต้องบอกว่าอาจจะยังไม่มีคนที่ใช่เข้ามา อาจจะต้องค้นหามองหาต่อไป แต่มันไม่ใช่จะไม่มีความหวัง เพียงแต่ยังไม่ใช่ช่วงเวลาที่จะมีเข้ามา",
                "health" to "สุขภาพอาจจะต้องระวังเพราะอาจจะเป็นช่วงที่อยู่คนเดียว อาจจะไม่มีคนดูแลโดยเฉพาะคนชราและอาจมีโรคจากการคิดมาก หรืออาการบาดเจ็บที่เกี่ยวกับขาได้ หรืออาจบ่งบอกถึงปัญหาเกี่ยวกับระบบการย่อย กระเพาะส่วนล่าง ลำไส้ ม้าม ถุงน้ำดี"
            ),
            dayAffinity = listOf("วันพุธ"),
            zodiacAffinity = listOf("ราศีกันย์")
        ),
        TarotCard(
            R.drawable.wheel_of_fortune,
            "Wheel of Fortune",
            mapOf(
                "work" to "ไพ่แสดงถึงการเปลี่ยนแปลงที่สำคัญในเรื่องการงาน โอกาสใหม่ๆที่เข้ามา อาจเป็นการเลื่อนตำแหน่ง การเปลี่ยนแปลงงาน หรือการได้งานใหม่ ซึ่งโดยปกติไพ่จะมีแนวโน้มเป็นไปในทางที่ดี",
                "money" to "อาจจะมีการเปลี่ยนแปลงเรื่องการเงิน จึงอาจจะหมายถึงโชคลาภ ที่มาถึงโดยไม่คาดฝัน อาจมีรายได้เพิ่มเติมหรือการลงทุนที่ประสบความสำเร็จ การเงินที่เคยติดขัดจะเริ่ม คลี่คลายและมีความมั่นคงมากขึ้น",
                "love" to "ความรักของไพ่ใบนี้หมายถึงการเปลี่ยนแปลง ความสัมพันธ์ของคุณจะเปลี่ยนแปลงซึ่งคุณก็อาจจะคาดไม่ถึง โดยส่วนใหญ่ไพ่ใบนี้จะแปลว่า โชคดี ดังนั้นจึงหมายถึงความโชคดีในด้านความรัก โชคชะตาได้หมุนให้ความสัมพันธ์ของคุณไปในทางที่ดีแล้วน",
                "health" to "มีการเปลี่ยนแปลงของสุขภาพที่ดีขึ้น วิธีการรักษาที่ได้ผลอาจหมายถึงการฟื้นตัวจากโรคภัยไข้ เจ็บ หรือการปรับเปลี่ยนพฤติกรรมเพื่อสุขภาพที่ดีขึ้นนอกจากนี้ไพ่ยังพูดถึงเรื่องของการกำจัดสารพิษในร่างกาย เรื่องตับ ภูมิแพ้ได้"
            ),
            dayAffinity = listOf("วันพฤหัสบดี"),
            zodiacAffinity = emptyList()
        ),
        TarotCard(
            R.drawable.justice,
            "Justice",
            mapOf(
                "work" to "ไพ่ใบนี้แสดงถึงความยุติธรรมและความเสมอภาคในที่ทำงาน มีความสามารถในการตัดสินใจที่ถูกต้องและเป็นธรรมด้วยเหตุและผล ทำให้งานเดินหน้าไปได้ด้วยดี",
                "money" to "บ่งบอกถึงจัดการการเงินได้ดี มีความรอบคอบและตัดสินใจเรื่องการเงินอย่างมีเหตุผล การใช้จ่ายเป็นไปอย่างระมัดระวัง คุณอาจได้รับการตอบแทนหรือผลประโยชน์จากการทำงานที่ยุติธรรมและถูกต้อง",
                "love" to "ความรักของไพ่ใบนี้จะเน้นไปที่ความเท่าเทียม การตัดสินใจด้วยเหตุผล มีการแลกเปลี่ยนความรักกันอย่างเท่าเทียม อาจมองได้ทั้งดีไม่ดี แต่ถ้าใบนี้ขึ้น ย่อมหมายถึงสิ่งที่ดีกับเราแน่นอนเพราะมันเป็นการตัดสินใจที่มีเหตุผล ",
                "health" to "มีการดูแลสุขภาพได้อย่างดี สมเหตุสมผล มีอาการก็ไปพบแพทย์ไม่ดื้อหรือทำตามใจจนเกินไป โรคที่อาจเกิดขึ้นจากไพ่เป็นได้ทั้ง หลังส่วนล่าง ไต รังไข่ แต่ไพ่ก็เน้นย้ำว่าทุกอย่างขึ้นอยู่ว่าคุณดูแลสุขภาพดีมั้ย อาจมีการรักษาการเยียวยาโดยเฉพาะการผ่าตัดได้"
            ),
            dayAffinity = listOf("วันศุกร์"),
            zodiacAffinity = listOf("ราศีตุลย์")
        ),
        TarotCard(
            R.drawable.hanged_man,
            "The hanged man",
            mapOf(
                "work" to "แสดงถึงการหยุดชะงักในงานหรือโครงการที่ต้องยอมรับสถานการณ์ บางครั้งต้องเสียสละและความพยายามเพื่อให้เกิดผลลัพธ์ที่ดีกว่าในอนาคต หรืออาจหมายถึงการเปลี่ยนมุมมอง การมองงานจากมุมมองใหม่ ๆ จะช่วยให้แก้ปัญหาที่พบได้ดีขึ้น",
                "money" to "การเงินมีการหยุดชะงัก ต้องยอมรับสถานการณ์ที่ไม่สามารถควบคุมได้ อาจต้องเสียสละบางส่วนของเงินทุนหรือรายได้เพื่อให้มีโอกาสที่ดีกว่าในอนาคต การมองการเงินจากมุมมองใหม่ ๆ และการปรับตัวในวิธีการ จัดการเงิน จะทำให้เห็นแนวทางที่ดีขึ้นได้ในอนาคต",
                "love" to "ความรักของไพ่ใบนี้ออกจะเป็นแนว ถ้าคบกันอยู่ก็จะเป็นการเสียสละ ยอมทน เพื่อความสัมพันธ์จะได้ดำเนินต่อไป หรืออาจหมายถึงการพัก เว้นระยะหรือห่างกันได้อีกด้วย ซึ่งจะมีลักษณะคล้ายการรอ ในกรณีที่อีก ฝ่ายต้องการระยะห่าง เวลาส่วนตัวหรือห่างหายไปบ้าง",
                "health" to "เป็นช่วงที่อาจจะมีอาการป่วยเข้ามา จนทำให้ต้องหยุดทำกิจกรรมต่าง ๆ จำเป็นต้องหยุดพักเพื่อการรักษาสุขภาพ"
            ),
            dayAffinity = emptyList(),
            zodiacAffinity = listOf("ราศีมีน")
        ),
        TarotCard(
            R.drawable.death,
            "Death",
            mapOf(
                "work" to "ไพ่แสดงถึงการสิ้นสุดของช่วงเวลาหรือสถานการณ์ที่สำคัญ ซึ่งอาจหมายถึงการเปลี่ยนงาน การเลื่อนตำแหน่ง การยุติโครงการ หรือการเปลี่ยนแปลงในบทบาทหน้าที่ เป็นจุดเปลี่ยนที่สำคัญหรืออาจจะบ่งบอก ถึงการเดินทางไปทำงานในต่างถิ่นต่างแดนได้",
                "money" to "ในเรื่องการเงิน อาจจะมีการเปลี่ยนแปลงครั้งใหญ่และการสิ้นสุดของสถานการณ์ทางการเงินที่เคยเป็นอยู่ อาจเป็นการปลดหนี้ หรือการเปลี่ยนแปลงวิธีการจัดการเงิน",
                "love" to "ไพ่ใบนี้มักหมายถึงการเปลี่ยนแปลงในความสัมพันธ์ เป็นการจบสถานะบางอย่างไปสู่สถานะใหม่ แน่นอนว่าเป็นความหมายที่ดีหรือไม่ดีก็ได้ครับ เช่น จากที่คุย ๆ ไม่ชัดเจนกัน ก็ชัดเจนขึ้นมา, จากที่เป็นแฟนกัน ก็อาจจะหมายถึงการหมดความรักต่อกันก็ได้",
                "health" to "แม้ไพ่จะดูแย่สำหรับเรื่องสุขภาพ แต่จริงๆ ไม่ได้แย่ขนาดนนั้นเพราะหมายถึงการเปลี่ยนแปลง เรื่องสุขภาพแสดงถึงการเปลี่ยนแปลงที่สำคัญและการสิ้นสุดของสิ่งเก่าเพื่อให้เกิดสิ่งใหม่ พฤติกรรมที่ไม่ดีต่อสุขภาพอาจหมายถึงการยุตินอกจากนี้ตัวไพ่ยังบ่งบอกถึงโรคหรืออาการที่เกิดบริเวณท้องน้อยไปจนถึงอวัยวเพศได้"
            ),
            dayAffinity = emptyList(),
            zodiacAffinity = listOf("ราศีพิจิก")
        ),
        TarotCard(
            R.drawable.temperance,
            "Temperance",
            mapOf(
                "work" to "ในด้านการงานหมายถึงการหาจุดสมดุลในการทำงาน อาจจะต้องปรับตัวและประสานงานกับเพื่อนร่วมงานเพื่อให้การทำงานเป็นไปอย่างราบรื่น นอกจากการปรับตัว อาจจะหมายถึงเป็นช่วงทดลองงาน ",
                "money" to "การเงินอยู่ในเกณฑ์ดี สามารถหาสมดุลหมุนเงินระหว่างรายได้และรายจ่ายได้อย่างดี อาจหมายถึงการปรับการจัดสรรเงินไปในสินทรัพย์ต่าง ๆ การปรับพอร์ตให้สมดุล",
                "love" to "ไพ่ใบนี้ในด้านความรักจะหมายถึง การที่เราหาสมดุลในความสัมพันธ์ เช่น บางทีเราความรู้สึกอาจมากเกินไป การกระทำอาจจะมากเกินไป ทำให้อี ฝ่ายอึดอัด เราก็จะต้องถอยออกมาค่อยเป็นค่อยไปทดลองปรับตัวให้อยู่ตรงกลาง ให้ความสัมพันธ์ดำเนินไปได้ด้วยดี",
                "health" to "ไพ่พูดถึงเรื่องการหาสมดุลและการเยียวยาเป็นหลัก ดังนั้นตัวไพ่จึงเน้นย้ำว่าสุขภาพของคุณอยู่ในเกณฑ์ที่ดี มีความสมดุลดี หากมีการรักษาก็จะได้ผลลัพธ์ที่ดี"
            ),
            dayAffinity = listOf("วันพฤหัสบดี"),
            zodiacAffinity = listOf("ราศีธนู")
        ),
        TarotCard(
            R.drawable.devil,
            "The Devil",
            mapOf(
                "work" to "การผูกมัดในที่ทำงาน พันธะสัญญาต่าง ๆ ที่ดูจะผูกมัดจำกัดมากเกินไป อาจมีการเผชิญกับสถานการณ์ที่ไม่สามารถหลุดพ้นได้",
                "money" to "อยู่ในสภาวะต้องใช้เงิน มีการลุ่มหลง ใช้จ่ายเงินเกินความจำเป็น หรืออาจหมายถึงการติดหนี้หรือการเสี่ยงเงินในสิ่งที่ไม่ควร เช่น การพนัน หรือการซื้อของฝุ่มเฟือย ต้องระวังเรื่องการใช้จ่ายเงินให้ดี\nง",
                "love" to "คโดยปกติไพ่ใบนี้ ถ้าแปลกันในหลายๆที่จะแปลถึงการมีชู้ การรักสามเส้า การนอกใจ การผิดศีล การโกหกหลอกลวง อันที่จริงที่แปลอย่างนี้เพราะไพ่มีความหมายถึงการหลงมัวเมา ดังนั้นก็เป็นไปได้ว่าจะไปหลงคนอื่น ซึ่งจริงๆมันก็เป็นไปได้ว่า เค้ามีสิ่งที่เค้าหลงใหลมากกว่าคุณ",
                "health" to "ไพ่บ่งบอกถึงโรคที่อาจเกิดขึ้น อาจเกี่ยวกับสารเสพติดหรือพฤติกรรมที่ไม่ดีต่อสุขภาพ เช่น การดื่มแอลกอฮอล์มากเกินไป การสูบบุหรี่ หรือการกินอาหารที่ไม่ดีต่อสุขภาพ นอกจากนี้ยังอาจหมายถึงการติดอยู่ในสถานการณ์ที่ทำให้สุขภาพจิตใจหรือร่างกายเสื่อมโทรม\n"
            ),
            dayAffinity = listOf("วันเสาร์"),
            zodiacAffinity = listOf("ราศีมังกร")
        ),
        TarotCard(
            R.drawable.tower,
            "The Tower",
            mapOf(
                "work" to "การเปลี่ยนแปลงที่ฉับพลันและไม่คาดคิดในที่ทำงาน อาจเป็นการเปลี่ยนแปลงในโครงสร้างองค์กร การถูกเลิกจ้าง หรือปัญหาทางธุรกิจที่ต้องรับมืออย่างเร่งด่วน",
                "money" to "การเปลี่ยนแปลงทางการเงินที่ฉับพลันและไม่คาดคิด อาจเป็นการสูญเสียเงินหรือรายได้ที่มีผลกระทบอย่างมาก เช่น การลงทุนที่ล้มเหลว หรือค่าใช้จ่ายที่เกิดขึ้นอย่างไม่คาดคิด",
                "love" to "ไพ่ใบนี้ในมุมมองความรัก ก็จะเป็นอะไรที่เรียกได้ว่าการเปลี่ยนแปลงกระทันหัน ความสัมพันธ์ก็อาจจะเปลี่ยนแปลงไปในทางที่ดีขึ้นหรือทางที่ไม่ดีก็ได้ แล้วแต่ไผ่ประกอบอื่นๆและสถานการณ์เป็นหลัก",
                "health" to "การเจ็บป่วยที่ไม่คาดคิดหรืออุบัติเหตุ คำแนะนำคือให้คุณเตรียมตัวรับมือกับสถานการณ์เหล่านี้โดยการ ดูแลสุขภาพตนเองอย่างสม้ำเสมอและมีแผนสำรองในกรณีที่เกิดปัญหา"
            ),
            dayAffinity = listOf("วันอังคาร"),
            zodiacAffinity = emptyList()
        ),
        TarotCard(
            R.drawable.star,
            "The Star",
            mapOf(
                "work" to "ไพ่หมายถึงโอกาสใหม่ ๆ และความสำเร็จที่รออยู่ข้างหน้า อาจได้รับการยอมรับในความสามารถและมีความ ก้าวหน้าในหน้าที่การงาน เห็นโอกาสในการก้าวหน้าา",
                "money" to "ไพ่ใบนี้แสดงถึงความหวังและการมองไปยังอนาคตที่ดีขึ้น คุณอาจได้รับโอกาสทางการเงินที่ดี การลงทุนมีโอกาสได้ผลตอบแทนที่ดี หรือมีแนวโน้มที่จะปรับปรุงพัฒนาแผนการเงินให้มั่นคงขึ้น",
                "love" to "ด้านความรักไพ่ใบนี้ บ่งบอกถึงความหวังในสิ่งใหม่ๆ โดยเฉพาะถ้าเป็นความสัมพันธ์ที่พึ่งเริ่มต้นใหม่ ก็จะเป็นความสัมพันธ์ที่ดีและจะได้สมหวังได้ตามแสงของดาว",
                "health" to "ไพ่ใบนี้เป็นไพ่ที่ดีแสดงถึงการฟื้นตัวและการรักษาที่ดีขึ้น มีความหวังในการรักษาสุขภาพ ทุกอย่างจะเยียวยาฟื้นฟูไปในทางที่ดีขึ้นทั้งร่างกายและจิตใจ"
            ),
            dayAffinity = emptyList(),
            zodiacAffinity = listOf("ราศีกุมภ์")
        ),
        TarotCard(
            R.drawable.moon,
            "The Moon",
            mapOf(
                "work" to " มีรู้สึกไม่มั่นคงในเรื่องงาน ไม่ว่าจะเป็นความก้าวหน้า ผลลัพธ์หรือวิธีการ จะเป็นช่วงที่มีความกังวลค่อน ข้างมาว่าจะทำยังไงดี และไพ่ใบนี้ยังหมายถึงการที่ไม่สามารถตัดสินใจได้เมื่อมีโอกาสด้านการงานใหม่ๆเข้ามาอีกด้วย",
                "money" to " การเงินมีความไม่มั่นคง มีความกังวลในเรื่องการเงิน ผลลัพธ์การลงทุน หรือเงินที่จะได้อาจจะมีปัญหา ติดขัดทำให้คุณไม่สามารถมั่นใจได้เลยว่าการเงินจะดีมั้ย",
                "love" to "ไพ่ในนี้ในเชิงความรัก ค่อนข้างเป็นไพ่ที่อ่อนไหวจริงๆ มันมีบางอย่างที่ผุดเปิดเผยขึ้นมาในความสัมพันธ์ เช่น เราไปรับรู้อะไรบางอย่างเกี่ยวกับเค้าที่ทำให้เรารู้สึกไม่มั่นคง ซึ่งจริงๆมันอาจจะไม่ได้เป็นอย่างนั้นก็ได้ ",
                "health" to "เนื่องจากตัวไพ่เน้นความกังวล ความเครียด เลยอาจบอกได้ว่าเป็นเรื่องของความเครียด กังวล ซึมเศร้าได้และตัวไพ่ยังบ่งบอกถึงโรคที่เกี่ยวกับระบบน้ำเหลือง"
            ),
            dayAffinity = listOf("วันจันทร์"),
            zodiacAffinity = listOf("ราศีมีน")
        ),
        TarotCard(
            R.drawable.sun,
            "The Sun",
            mapOf(
                "work" to "ความสำเร็จ ความเจริญรุ่งเรือง และความพึงพอใจในงานที่ทำ อาจได้รับการยอมรับและชื่นชมจากเพื่อน ร่วมงานหรือผู้บังคับบัญชา อะไรที่รอคอยไม่ชัดเจน ก็จะชัดเจนในช่วงนี้ ",
                "money" to "ความสำเร็จ ความมั่งคั่ง และความเจริญรุ่งเรืองทางการเงิน คุณมีโอกาสที่จะได้รับผลตอบแทนจากการลงทุนหรือการทำงานที่ได้ทำไว้ ความมั่นคงทางการเงินจะนำมาซึ่งความสุขและความพึงพอใจ",
                "love" to "ไพ่ใบนี้ในเรื่องความรักก็สดใสความสัมพันธ์เป็นความสัมพันธ์ที่มีความหวัง มีความมุ่งมั่น ธงสีแดงที่หมายถึงความปรารถนา ที่จะประสบผลสำเร็จและราบริ่น",
                "health" to " มีความแข็งแรงและความมีชีวิตชีวา คำแนะนำคือให้คุณรักษาวิถีชีวิตที่มีสุขภาพดี การอยู่กลางแจ้งและรับแสงแดดอ่อน ๆ ก็เป็นสิ่งที่ดีต่อสุขภาพจิตและร่างกาย"
            ),
            dayAffinity = listOf("วันอาทิตย์"),
            zodiacAffinity = listOf("ราศีสิงห์")
        ),
        TarotCard(
            R.drawable.judgement,
            "The Judgement",
            mapOf(
                "work" to "การตัดสินใจที่สำคัญหรือการเปลี่ยนแปลงที่จำเป็นในการงาน สิ่งต่าง ๆ ที่ทำมาจะได้ผลลัพธ์ในตอนนี้ ถ้าทำมาดีก็อาจเป็นการได้รับการเลื่อนตำแหน่ง การย้ายงาน หรือการเริ่มงานใหม่ ",
                "money" to "การประกาศผลลัพธ์ที่ได้ทำไป การลงทุน หรืออะไรต่างๆ เริ่มเห็นผลตอบแทนจากสิ่งที่ทำมา อาจหมายถึงการเป็นการตัดสินใจพิจารณาการลงทุน",
                "love" to "ไพ่ใบนี้มักหมายถึง การตัดสินใจ ถึงเวลาที่คุณจะตัดสินใจเลือกแล้วว่า ความสัมพันธ์นี้ดีหรือไม่ดี มันโอเคมั้ย ถ้าไม่ก็อาจถึงเวลาที่ต้องตัดสินใจ การตัดสินใจก็ขึ้นอยู่กับการประเมินของคุณ",
                "health" to "หากรักษาตัวดี ดูแลสุขภาพดี อาจหมายถึงสุขภาพที่ดี หากไม่ดูแลตัวเองก็จะส่งผลให้อาจจะมีโรคหรือมีอะไรที่ชุกอยู่ภายใน เปิดเผยเกิดขึ้นได้"
            ),
            dayAffinity = emptyList(),
            zodiacAffinity = listOf("ราศีพิจิก")
        ),
        TarotCard(
            R.drawable.world,
            "The World",
            mapOf(
                "work" to " ความหมายไพ่ใบนี้ ไพ่บ่งบอกถึงการจบสิ้น เสร็จสมบูรณ์ ในด้านการงานหมายถึงความสำเร็จและการบรรลุเป้าหมายที่คุณตั้งไว้ ส่งผลให้เป็นช่วงเวลาที่จะได้เป็นอิสระ",
                "money" to "ความหมายไพ่ใบนี้คือสถานการณ์การเงินของคุณอยู่ในเกณฑ์ดี เหมือนมีอิสระทางการเงิน ในช่วงนี้อาจได้รับผลตอบแทนจากการลงทุนหรือการทำงานหนักที่ผ่านมาของคุณ",
                "love" to "ความหมายของไพ่ใบนี้คือความรักที่สมบูรณ์ เรียกได้ว่าไม่ได้มีอะไรหวือหวา ไม่ได้มีอะไรแปลกประหลาดพวกคุณสองคนรักกันดี ซึ่งแค่นี้ก็เพียงพอแล้วสำหรับความสัมพันธ์",
                "health" to "ความหมายไพ่ใบนี้คือสุขภาพของคุณอยู่ในเกณฑ์ดี มีอิสระ มีความสมบูรณ์พูนสุขอย่างดี เรียกได้ว่าเป็นช่วงเวลาที่มีการดูแลตัวเองดีส่งผลให้ทุกอย่างดีไปด้วย"
            ),
            dayAffinity = listOf("วันเสาร์"),
            zodiacAffinity = listOf("ราศีมังกร")
        ),

    )

}